{
    "posts": {
        "posts": {
            "how-to-use-salesforce-shoppercontext-api": {
                "title": "ShopperContext API",
                "headline": "O Potencial de Personalização: A ShopperContext API da Salesforce Transforma as Experiências dos Clientes",
                "description": "Descubra como a ShopperContext API da Salesforce capacita as empresas a desbloquearem todo o potencial da personalização. Supere as limitações das APIs anteriores e utilize os dados de grupos de clientes para fornecer experiências personalizadas, promoções segmentadas e conteúdo personalizado. Aumente o engajamento do cliente, impulsione as conversões e eleve a estratégia de comércio eletrônico com o poder da ShopperContext API.",
                "shortDescription": "Desbloqueie experiências personalizadas e promoções segmentadas com a ShopperContext API da Salesforce. Utilize os dados de grupos de clientes e supere as limitações das APIs anteriores para aumentar o engajamento e impulsionar as conversões. Eleve sua estratégia de comércio eletrônico hoje mesmo.",
                "author": "Fernando Ruch",
                "authorImage": "/fernando.jpeg",
                "authorImageAlt": "Fernando Ruch",
                "postCardImage": "/posts/how-to-use-salesforce-shoppercontext-api.png",
                "postCardImageAlt": "Como utilizar a ShopperContext API",
                "postDate": "16 de Junho",
                "keywords": "Salesforce, ShopperContext, API, OCAPI, SCAPI, Commerce Cloud, B2C Commerce, B2C Commerce API",
                "ariaLabel": "Acessar o post ShopperContext API escrito por Fernando Ruch em 16 de Junho",
                "content": [
                    {
                        "type": "youtube",
                        "videoId": "aB9ZONBI3So",
                        "title": "Como utilizar a ShopperContext API"
                    },
                    {
                        "type": "paragraph",
                        "text": "Proporcionar experiências personalizadas tornou-se uma estratégia fundamental para o sucesso do comércio eletrônico. A Salesforce entende essa necessidade e oferece a poderosa ShopperContext API para permitir que as empresas criem interações personalizadas com seus clientes. Neste guia passo a passo, exploraremos como configurar a ShopperContext API da Salesforce para desbloquear todo o potencial das experiências personalizadas. Seguindo estas instruções, você estará bem encaminhado para fornecer promoções altamente segmentadas, recomendações personalizadas e satisfação excepcional do cliente."
                    },
                    {
                        "type": "heading",
                        "text": "Passo 1: Habilite o ShopperContext no seu Business Manager"
                    },
                    {
                        "type": "paragraph",
                        "text": "Comece acessando o Business Manager e navegue até Administração > Preferências Globais > Chaves de Recursos. Localize a opção 'Habilitar ShopperContext' e habilite-a para ativar a ShopperContext API no seu ambiente. Este passo garante que a funcionalidade da API esteja disponível para uso."
                    },
                    {
                        "type": "heading",
                        "text": "Passo 2: Obtenha um Token SLAS"
                    },
                    {
                        "type": "paragraph",
                        "text": "Para interagir com a ShopperContext API, você precisa de um token SLAS válido. Certifique-se de que seu ID de API tenha o escopo sfcc.shopper-context.rw adicionado. Esse escopo permite acesso de leitura e gravação aos dados de contexto do comprador, permitindo que você utilize as capacidades da API de forma eficaz."
                    },
                    {
                        "type": "heading",
                        "text": "Passo 3: Crie Grupos de Clientes Baseados em Sessão"
                    },
                    {
                        "type": "paragraph",
                        "text": "Aproveitar os grupos de clientes baseados em sessão é uma forma poderosa de personalizar experiências. Utilize a ShopperContext API para criar grupos de clientes baseados em sessão usando session.custom. Defina grupos de clientes com base em atributos como tipo de dispositivo, dados demográficos ou qualquer outro critério relevante específico para o seu negócio. Esse passo permite esforços de personalização direcionados."
                    },
                    {
                        "type": "heading",
                        "text": "Passo 4: Crie Promoções e Campanhas para Grupos de Clientes"
                    },
                    {
                        "type": "paragraph",
                        "text": "Depois de estabelecer seus grupos de clientes, crie promoções e campanhas personalizadas para esses segmentos. Utilize a ShopperContext API para fornecer promoções segmentadas, descontos e ofertas especiais que estejam alinhadas com as preferências e comportamentos de cada grupo de clientes. Esse nível de personalização melhora o engajamento do cliente e aumenta a probabilidade de conversões."
                    },
                    {
                        "type": "heading",
                        "text": "Passo 5: Testando os Endpoints da ShopperContext API"
                    },
                    {
                        "type": "paragraph",
                        "text": "Para garantir o bom funcionamento da ShopperContext API, utilize os endpoints fornecidos na Coleção do Postman. O Postman é uma ferramenta poderosa para desenvolvimento e teste de APIs. Execute solicitações nos endpoints da API, verificando se os dados de contexto do comprador desejados estão sendo recuperados e utilizados conforme o esperado. Testes abrangentes garantem uma integração perfeita e confirmam que as experiências personalizadas estão sendo entregues com precisão."
                    },
                    {
                        "type": "paragraph",
                        "text": "Seguindo este guia passo a passo, você pode configurar com sucesso a ShopperContext API da Salesforce e desbloquear o poder das experiências personalizadas. Ao habilitar o ShopperContext no seu Business Manager, obter um token SLAS, criar grupos de clientes baseados em sessão e personalizar promoções e campanhas, você estará aproveitando as capacidades da API ao máximo. Por fim, utilize os endpoints fornecidos na Coleção do Postman para testar e validar a funcionalidade. Com a ShopperContext API, você pode oferecer promoções altamente segmentadas, recomendações personalizadas e experiências personalizadas excepcionais, o que leva a uma maior satisfação do cliente e melhores resultados comerciais."
                    },
                    {
                        "type": "cta",
                        "url": "https://github.com/team-develoci/shopper-context-api-postman-collection",
                        "label": "Baixe a Coleção do Postman em nosso Github"
                    }
                ]
            },
            "update-salesforce-commerce-cloud-token": {
                "title": "UUID token será descontinuado",
                "headline": "Atualização Importante: Salesforce Descontinuará Formatos de Token UUID no Account Manager do Commerce Cloud",
                "description": "A Salesforce anuncia a descontinuação dos formatos de token UUID para clientes da API no Account Manager do Commerce Cloud. Saiba mais sobre as mudanças e as etapas necessárias para mudar para tokens de acesso JWT antes do prazo de 15 de junho de 2023 para evitar falhas de autenticação.",
                "shortDescription": "A Salesforce anuncia a descontinuação dos formatos de token UUID para clientes da API no Account Manager do Commerce Cloud.",
                "author": "Cassio Lacerda",
                "authorImage": "/cassio.jpeg",
                "authorImageAlt": "Cassio Lacerda",
                "postCardImage": "/posts/update-salesforce-commerce-cloud-token.jpg",
                "postCardImageAlt": "Post cover",
                "postDate": "05 de Maio",
                "keywords": "Salesforce, Descontinuação, Formatos de token UUID, Clientes de API, Gerenciador de Contas do Commerce Cloud, Alterações, Mudança para tokens de acesso JWT, Prazo de 15 de junho de 2023, Falhas de autenticação",
                "ariaLabel": "Ir para o post UUID token será descontinuado escrito por Cassio Lacerda em 5 de maio",
                "content": [
                    {
                        "type": "youtube",
                        "videoId": "dTcip5-__kM",
                        "title": "Salesforce Descontinuará Formatos de Token UUID no Account Manager do Commerce Cloud"
                    },
                    {
                        "type": "paragraph",
                        "text": "A Salesforce está comprometida em garantir a segurança e o sucesso de seus clientes. De acordo com esse compromisso, a Salesforce anunciou que, a partir de 15 de junho de 2023, não oferecerá mais suporte ao uso de formatos de token UUID para clientes da API no Gerenciador de Contas do Commerce Cloud. Os clientes que continuarem a usar os formatos de token UUID podem enfrentar falhas de autenticação. Para evitar tais problemas, recomenda-se que os clientes mudem para o formato de token JWT antes do prazo."
                    },
                    {
                        "type": "heading",
                        "text": "Como essa mudança afeta os clientes?"
                    },
                    {
                        "type": "paragraph",
                        "text": "Esta mudança impacta os clientes do Commerce Cloud que possuem aplicativos clientes da API configurados para usar formatos de token de acesso UUID. Para garantir uma transição tranquila, os clientes devem atualizar suas configurações de formato de token de acesso para clientes da API existentes de tokens UUID para tokens JWT."
                    },
                    {
                        "type": "heading",
                        "text": "Cronograma para mudança"
                    },
                    {
                        "type": "list",
                        "items": [
                            "A partir de 15 de junho de 2023, a Salesforce não oferecerá mais suporte ao uso de formatos de token UUID para clientes da API no Gerenciador de Contas do Commerce Cloud.",
                            "A partir de 15 de junho de 2023, todos os clientes da API que utilizam o formato de token de acesso UUID serão alterados para o formato de token JWT."
                        ]
                    },
                    {
                        "type": "heading",
                        "text": "Como mudar para tokens de acesso JWT"
                    },
                    {
                        "type": "paragraph",
                        "text": "Para alterar a configuração do formato de token de acesso para um cliente da API que utiliza uma configuração UUID, siga estas etapas:"
                    },
                    {
                        "type": "ordered_list",
                        "items": [
                            "Faça login no Gerenciador de Contas.",
                            "Clique em Cliente da API. A página Clientes da API exibe uma lista de clientes da API.",
                            "Filtre pela opção de formato de token, selecione UUID e liste todos os clientes da API que usam UUID. Se você não possui nenhum cliente da API usando UUID, nenhuma ação adicional é necessária.",
                            "Clique em um cliente da API usando UUID para acessar sua página de configuração.",
                            "Role até a parte inferior da página e defina o formato de token de acesso como JWT.",
                            "Clique em Salvar e repita esse processo para todos os clientes da API que usam UUID."
                        ]
                    },
                    {
                        "type": "paragraph",
                        "text": "Ao fazer essa mudança para tokens JWT, a maioria dos códigos de cliente da API não será afetada. No entanto, os clientes que verificam o comprimento do token UUID como parte de seu código de cliente da API enfrentarão falhas se não removerem essa verificação antes da Data de Descontinuação do UUID."
                    },
                    {
                        "type": "paragraph",
                        "text": "É importante se manter informado e agir sobre essa mudança para garantir a segurança e o sucesso de sua experiência no Gerenciador de Contas do Salesforce Commerce Cloud."
                    },
                    {
                        "type": "cta",
                        "url": "https://github.com/team-develoci/SFB2C-UUID-vs-JWT-Postman-Collection",
                        "label": "Download Postman Collection em nosso Github"
                    }
                ]
            }
        },
        "pageTitle": "Lista de posts"
    }
}
